{"title":"Call of Duty: Modern Warfare II Review – Wide Of The Mark\n","content":"\n                                                                                                                                                                                                                                    \n\n\n\n      <p><img src=\"https:\/\/www.gameinformer.com\/sites\/default\/files\/styles\/body_default\/public\/2022\/06\/08\/87c3ff93\/mw2header.jpg\" width=\"800\" height=\"450\" alt=\"\" typeof=\"foaf:Image\" class=\"image-style-body-default\" \/><\/p>\n\n  <p>\n              <b>Reviewed on:<\/b>\n      PlayStation 5\n      <br \/>\n                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                <b>Platform:<\/b>\n      PlayStation 5, Xbox Series X\/S, PlayStation 4, Xbox One, PC\n      <br \/>\n                  <b>Publisher:<\/b>\n      Activision\n      <br \/>\n              <b>Developer:<\/b>\n      Infinity Ward\n      <br \/>\n                  <b>Rating:<\/b>\n      Mature\n      <\/p>\n\n      <p>Call of Duty: <a href=\"https:\/\/www.gameinformer.com\/product\/call-of-duty-modern-warfare-ii\" target=\"_blank\">Modern Warfare II<\/a> is a very unpleasant game. Like every Call of Duty game, the majority of time spent playing involves either killing or being killed in horrendous ways, for one thing, and there’s a natural revulsion that comes from seeing so many gouts of blood shooting from bodies or the ragged slump of newly lifeless human corpses piled up in a doorway. And yet, the surface-level hideousness of its parade of death might not be so notably ugly if it wasn't for Modern Warfare II's cast of characters and the way they – drawn from international special forces, a private military company’s contractors, and a Mexican cartel – view the world.<\/p>\n\n<p>Modern Warfare II opens with a lightly fictionalized version of the real-life assassination of Iranian Quds Force commander Major General Qasem Soleimani. As in the actual Soleimani’s killing, Call of Duty’s fictional Quds Force commander “Major Ghorbrani” is assassinated by American forces using a drone strike, here controlled by the player. In a departure from recent history, this affront to a sovereign nation is met with a byzantine terrorist retaliation plot concocted by the dead general’s successor, Major Hassan Zyani. Sketched in brief, this plot is a modern paranoiac’s dreams come to life, Zyani collaborating with Russian allies and a fictional Mexican cartel to plan a missile strike on the continental United States.<\/p>\n\n<p>While Call of Duty has pulled from recent history to frame its stories in the past, basing Modern Warfare II's set-up on such a contentious event – and naming Iran specifically rather than choosing to abstract the reference by setting the assassination in one of the series' fictional nations – provides a promise for narrative ambition that the game fails to fulfill. Instead of delving into the political murkiness that the Modern Warfare subseries is well positioned to examine, what follows is a disappointingly cynical and aimless exercise in storytelling.   <\/p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\n\n  \n    \n\n  \n      \n            <img src=\"https:\/\/www.gameinformer.com\/sites\/default\/files\/styles\/body_default\/public\/2022\/06\/08\/0eb75c2f\/mw2heli.jpg\" typeof=\"foaf:Image\" alt=\"\" class=\"image-style-body-default\" \/>\n\n\n      \n  \n\n\n\n\n\n\n\n\n\n\n<p>Players assume the viewpoints of characters attempting to thwart Zyani, embarking on a whirlwind globe tour that throws away the larger implications of the story's conflict in favor of more immediate, less complicated matters.These characters include British members of the invented Task Force 141 and Alejandro Vargas, a colonel in the Mexican Special Forces, as well as occasional segments seen through the eyes (and lens of a gunship camera) of Modern Warfare II’s American-based private military organization, Shadow Company.<\/p>\n\n<p>The plot unfolds in predictably bloody fashion. Players turn distant enemies into puffs of red while sniping during stealthy infiltration missions, run and gun and blow stuff up in all-out firefights, and control or call in air support to blast distant targets into dark smears. They do so motivated by the urgency of survival. What the Iranian, Russian, Mexican, or the American government (outside of one CIA Station Chief and a general) think of their countries covertly and openly tearing each other apart is ignored to concentrate instead on the granular next steps in advancing or stopping Zyani's plans. <\/p>\n\n<p>Modern Warfare II is determined not to bore the player by constantly tweaking Call of Duty’s fast-paced, first-person gunfights as it tells this story from mission to mission. At its best, the flexibility of its format allows the game to switch genres to heighten its dramatic purposes. In one mission, for example, Task Force 141 operative John \"Soap\" MacTavish is stranded in a small Mexican city’s cobblestoned streets. As he tries to hide from the American PMCs mercilessly executing civilians throughout a stretch of moonlit alleys and roads, Soap finds himself cast in a veritable horror movie. The player must collect household materials to craft tools and weapons to pick off members of a superior force as they set about their massacre. The dark of the night and the presence of so much brutality construct strong, appropriately shocking imagery of the PMCs' evil. Soap, stalking through the shadows of gore-stained houses, shops, and alleyways, becomes another creature from a nightmare thanks to the level's design. If this mission was another of Call of Duty's all-out firefights, it would have little room to establish that same sense of dread. Here, a willingness to play loose with form heightens storytelling possibilities.    <\/p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\n\n  \n    \n\n  \n      \n            <img src=\"https:\/\/www.gameinformer.com\/sites\/default\/files\/styles\/body_default\/public\/2022\/11\/01\/d5941685\/mw2-seasonal.jpg\" typeof=\"foaf:Image\" alt=\"\" class=\"image-style-body-default\" \/>\n\n\n      \n  \n\n\n\n\n\n\n\n\n\n\n<p>In other cases, though, numerous sequences that should be thrilling on premise alone – hanging upside down from a speeding helicopter while shooting enemies; fighting from hijacked truck to hijacked truck up to the front of a convoy, Fast &amp; Furious-style; swimming through an Amsterdam port and dispatching patrols before sinking back into the dark waters once more – become tiring exercises in trial and error. The fragility of the enemy and player alike interrupt the action by making the margin for error so slim that what should be exciting sequences end up coming across more like someone repeatedly sitting on a remote control’s pause button during an intense scene by mistake.<\/p>\n\n<p>Aside from the few levels that validate Modern Warfare II’s emphasis on variety, the traditionally designed firefights make the campaign exciting. One involves the player participating in raids on a series of rural homes, navigating the inky darkness of an overcast night through the queasy green of night-vision goggles. It even ends with you defending a crashed helicopter from inside its ruined interior while enemies advance to attack from across a smoking, firelit field. Even if the game featured a few more missions with staging this compelling, the plot would still color Modern Warfare II in offputting tones. Simply put: None of its cast seems to care about anything.<\/p>\n\n<p>During cutscene interludes breaking up the action, the characters find little time to discuss their mission beyond identifying the next part of the globe to fly off to or the next enemy who needs their brain pulped. They are all blandly gruff, almost seeming to compete in a gravel gargling contest as they discuss the grim necessities of extrajudicial murder or trade strained banter during tense moments. These are the kind of characters who, when handed a hunting knife with which to kill a cartel boss, grumble the single word “sweet” in response.<\/p>\n\n<p>No motivation is expressed by the characters beyond the most cynical realpolitik or greed. If any members of Task Force 141 have nuanced opinions about the countries whose militaries they’re fighting or the cartel forces abetting an international terror plot, they keep it to themselves. Even Zyani speaks of his hatred of America in only the most general terms. There is no greater political or religious mission for anyone, likely in fear of alienating any demographic that may play the game. There are only reactions to circumstances – a kind of kneejerk fantasy of global politics that sidesteps historical context in favor of painting an Iranian major as an uncomplicatedly evil villain.<\/p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\n\n  \n    \n\n  \n      \n            <img src=\"https:\/\/www.gameinformer.com\/sites\/default\/files\/styles\/body_default\/public\/2022\/06\/09\/f8b2189b\/cod2.jpg\" typeof=\"foaf:Image\" alt=\"\" class=\"image-style-body-default\" \/>\n\n\n      \n  \n\n\n\n\n\n\n\n\n\n\n<p>One exception to this nihilistic pattern is Colonel Vargas, who is forced to shoulder the massive weight of Modern Warfare II’s stunningly grim depiction of Mexico. As one of the few heroic viewpoint characters, Vargas is asked to embody the noble and incorruptible crime-fighter that, in Call of Duty’s viewpoint, is the only possible means of solving a nation’s complex internal and hegemonically enforced problems. Though Vargas is a welcome character in this sense – him narrowly avoiding death from the overeager trigger fingers of police and armed citizens of a Texan border town who can’t distinguish between him and cartel sicarios is striking – he’s also an overly simplistic one. Vargas, like the game’s depiction of Mexico as a whole, is drawn from a position of sanctimonious pity – one that sees the country populated not by criminals, as in the simple, racist viewpoint, but by perpetually doomed unfortunates whose misery can’t be understood beyond its inevitability.    <\/p>\n\n<p>Vargas, however, is just one character among many, and the question remains, as is the case with every Call of Duty entry, of what purpose the dead-end ugliness of the rest of the game serves. That Modern Warfare II’s characters exist is not an endorsement of their actions. That the story they star in exists to frame their attitudes toward the world, though, means all of the virtual shooting and death must mean something.<\/p>\n\n<p>Unfortunately, Modern Warfare II has no ready answers to these questions. The campaign’s story is agile in side-stepping concrete ideological positions, slippery in establishing any political footing beyond a basic recognition that attacking civilian populations is morally wrong. The game's writers seem to believe in very little beyond the current status quo of international politics, anxious to avoid much specificity and, by doing so, resigned to a stalemate existence of looming terror and secret wars fought by covert operatives forevermore. As an extension of this, Modern Warfare II asserts that our desire to play pretend in its fevered war dreams is testament to there being a magnetic thrill to witnessing the kind of combat in which regular military and special operatives engage around the world.<\/p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\n\n  \n    \n\n  \n      \n            <img src=\"https:\/\/www.gameinformer.com\/sites\/default\/files\/styles\/body_default\/public\/2022\/11\/01\/5872739b\/mw2-home-spec-ops.jpg\" typeof=\"foaf:Image\" alt=\"\" class=\"image-style-body-default\" \/>\n\n\n      \n  \n\n\n\n\n\n\n\n\n\n\n<p>The multiplayer, as always, functions as the best proof of this assertion. Compulsively thrilling in its best modes – Domination, Team Deathmatch, Hardpoint, and Kill Confirmed – Modern Warfare II’s gunplay finds better expression in the hamster wheel of endless online competition than it does in its single-player mode this time around. <\/p>\n\n<p>Few major changes have been introduced to multiplayer overall, but the tweaks that have been made to player movement, the speed at which competitors can kill (or be killed), and loadout customization options work to make Modern Warfare II's online some of the series' best in recent years. The result is less a drastic overhaul to the style of online shooting that Call of Duty's featured for years and more a welcome series of refinements that amplify what works and minimize what doesn't.     <\/p>\n\n<p>New modes, like Prisoner Rescue, playlists featuring a disorienting third-person camera, and a trio of co-op missions, are less exciting, but their inclusion doesn’t take away from the substantial volume of returning modes that take place in the new maps and provide a framework for exceptional shooting. Freed from the single-player’s trappings, appreciating the game’s feel is easier. The elastic response of pressing a controller trigger so an assault rifle’s sights spring up into view, the dull thud of rounds hitting home, and the spry weight of the player character: Modern Warfare II’s multiplayer is a tightly designed display of its makers’ talents.<\/p>\n\n                  <section class='type:slideshow'><figure><img src='https:\/\/www.gameinformer.com\/sites\/default\/files\/styles\/body_default\/public\/2022\/11\/01\/d5941685\/mw2-seasonal.jpg'><\/figure><figure><img src='https:\/\/www.gameinformer.com\/sites\/default\/files\/styles\/body_default\/public\/2022\/09\/15\/6751b69b\/mw1.jpg'><\/figure><figure><img src='https:\/\/www.gameinformer.com\/sites\/default\/files\/styles\/body_default\/public\/2022\/09\/15\/f1ba6fa3\/mw2.jpg'><\/figure><figure><img src='https:\/\/www.gameinformer.com\/sites\/default\/files\/styles\/body_default\/public\/2022\/09\/15\/4d8b6886\/mw3.jpg'><\/figure><figure><img src='https:\/\/www.gameinformer.com\/sites\/default\/files\/styles\/body_default\/public\/2022\/06\/09\/53b0efc3\/cod1.jpg'><\/figure><figure><img src='https:\/\/www.gameinformer.com\/sites\/default\/files\/styles\/body_default\/public\/2022\/06\/08\/ef799de4\/mw2map.jpg'><\/figure><\/section>\n           \n\n<p>But still, the game’s dismal narrative creeps in to curdle even its best features. Maps like a Mexico-U.S. border crossing traffic jam, bombed-out Ottoman forts in a fictitious Middle Eastern village, and a Mexican city turned battlefield are all excellent blueprints for online shoot-outs. But they also serve as a reminder that the multiplayer is a reflection of the campaign’s plot. Severed from its storyline, the disjointed visions of nations in flames and ruins, overrun by soldiers, are hardly less nasty than the rest of the narrative.  <\/p>\n\n<p>Severing these connections and focusing instead of the immediate pleasures of competition is tough but not impossible. With a few friends talking over the crack of gunfire and an eye trained on the burst of experience points that pop from a newly dead opponent, Modern Warfare II is perfectly enjoyable. But this kind of wilful blindness is hard to maintain, and the impression left is overwhelmed by the unpleasantness that defines so much of the game. Ignoring that for long makes it much harder to appreciate what Modern Warfare II does right than it should be.<\/p>\n\n<p>Whether any of this is enough to put off an audience inured to Call of Duty’s detached depiction of brutal warfare is anyone’s guess. Plenty of people can put up with a bit of ugliness if there’s still a pretty good time to be had overall. For Modern Warfare II, the good time offered by its multiplayer and in glimpses within its campaign may be enough.<\/p>\n  \n\n    <h2>Score:\n    6.5<\/h2>\n  <p>\n    <a href=\"https:\/\/www.gameinformer.com\/scoring\" target=\"_blank\">About Game Informer's review system<\/a>\n  <\/p>\n\n<a href=\"https:\/\/www.gamestop.com\/search\/?q=Call%20of%20Duty%3A%20Modern%20Warfare%20II\" target=\"_blank\" class=\"button\">Purchase<\/a>","description":"\n                                                                                                                                                                                                                                    \n\n\n\n      <p><img src=\"https:\/\/www.gameinformer.com\/sites\/default\/files\/styles\/body_default\/public\/2022\/06\/08\/87c3ff93\/mw2header.jpg\" width=\"800\" height=\"450\" alt=\"\" typeof=\"foaf:Image\" class=\"image-style-body-default\" \/><\/p>\n\n  <p>\n              <b>Reviewed on:<\/b>\n      PlayStation 5\n      <br \/>\n                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                <b>Platform:<\/b>\n      PlayStation 5, Xbox Series X\/S, PlayStation 4, Xbox One, PC\n      <br \/>\n                  <b>Publisher:<\/b>\n      Activision\n      <br \/>\n              <b>Developer:<\/b>\n      Infinity Ward\n      <br \/>\n                  <b>Rating:<\/b>\n      Mature\n      <\/p>\n\n      <p>Call of Duty: <a href=\"https:\/\/www.gameinformer.com\/product\/call-of-duty-modern-warfare-ii\" target=\"_blank\">Modern Warfare II<\/a> is a very unpleasant game. Like every Call of Duty game, the majority of time spent playing involves either killing or being killed in horrendous ways, for one thing, and there’s a natural revulsion that comes from seeing so many gouts of blood shooting from bodies or the ragged slump of newly lifeless human corpses piled up in a doorway. And yet, the surface-level hideousness of its parade of death might not be so notably ugly if it wasn't for Modern Warfare II's cast of characters and the way they – drawn from international special forces, a private military company’s contractors, and a Mexican cartel – view the world.<\/p>\n\n<p>Modern Warfare II opens with a lightly fictionalized version of the real-life assassination of Iranian Quds Force commander Major General Qasem Soleimani. As in the actual Soleimani’s killing, Call of Duty’s fictional Quds Force commander “Major Ghorbrani” is assassinated by American forces using a drone strike, here controlled by the player. In a departure from recent history, this affront to a sovereign nation is met with a byzantine terrorist retaliation plot concocted by the dead general’s successor, Major Hassan Zyani. Sketched in brief, this plot is a modern paranoiac’s dreams come to life, Zyani collaborating with Russian allies and a fictional Mexican cartel to plan a missile strike on the continental United States.<\/p>\n\n<p>While Call of Duty has pulled from recent history to frame its stories in the past, basing Modern Warfare II's set-up on such a contentious event – and naming Iran specifically rather than choosing to abstract the reference by setting the assassination in one of the series' fictional nations – provides a promise for narrative ambition that the game fails to fulfill. Instead of delving into the political murkiness that the Modern Warfare subseries is well positioned to examine, what follows is a disappointingly cynical and aimless exercise in storytelling.   <\/p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\n\n  \n    \n\n  \n      \n            <img src=\"https:\/\/www.gameinformer.com\/sites\/default\/files\/styles\/body_default\/public\/2022\/06\/08\/0eb75c2f\/mw2heli.jpg\" typeof=\"foaf:Image\" alt=\"\" class=\"image-style-body-default\" \/>\n\n\n      \n  \n\n\n\n\n\n\n\n\n\n\n<p>Players assume the viewpoints of characters attempting to thwart Zyani, embarking on a whirlwind globe tour that throws away the larger implications of the story's conflict in favor of more immediate, less complicated matters.These characters include British members of the invented Task Force 141 and Alejandro Vargas, a colonel in the Mexican Special Forces, as well as occasional segments seen through the eyes (and lens of a gunship camera) of Modern Warfare II’s American-based private military organization, Shadow Company.<\/p>\n\n<p>The plot unfolds in predictably bloody fashion. Players turn distant enemies into puffs of red while sniping during stealthy infiltration missions, run and gun and blow stuff up in all-out firefights, and control or call in air support to blast distant targets into dark smears. They do so motivated by the urgency of survival. What the Iranian, Russian, Mexican, or the American government (outside of one CIA Station Chief and a general) think of their countries covertly and openly tearing each other apart is ignored to concentrate instead on the granular next steps in advancing or stopping Zyani's plans. <\/p>\n\n<p>Modern Warfare II is determined not to bore the player by constantly tweaking Call of Duty’s fast-paced, first-person gunfights as it tells this story from mission to mission. At its best, the flexibility of its format allows the game to switch genres to heighten its dramatic purposes. In one mission, for example, Task Force 141 operative John \"Soap\" MacTavish is stranded in a small Mexican city’s cobblestoned streets. As he tries to hide from the American PMCs mercilessly executing civilians throughout a stretch of moonlit alleys and roads, Soap finds himself cast in a veritable horror movie. The player must collect household materials to craft tools and weapons to pick off members of a superior force as they set about their massacre. The dark of the night and the presence of so much brutality construct strong, appropriately shocking imagery of the PMCs' evil. Soap, stalking through the shadows of gore-stained houses, shops, and alleyways, becomes another creature from a nightmare thanks to the level's design. If this mission was another of Call of Duty's all-out firefights, it would have little room to establish that same sense of dread. Here, a willingness to play loose with form heightens storytelling possibilities.    <\/p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\n\n  \n    \n\n  \n      \n            <img src=\"https:\/\/www.gameinformer.com\/sites\/default\/files\/styles\/body_default\/public\/2022\/11\/01\/d5941685\/mw2-seasonal.jpg\" typeof=\"foaf:Image\" alt=\"\" class=\"image-style-body-default\" \/>\n\n\n      \n  \n\n\n\n\n\n\n\n\n\n\n<p>In other cases, though, numerous sequences that should be thrilling on premise alone – hanging upside down from a speeding helicopter while shooting enemies; fighting from hijacked truck to hijacked truck up to the front of a convoy, Fast &amp; Furious-style; swimming through an Amsterdam port and dispatching patrols before sinking back into the dark waters once more – become tiring exercises in trial and error. The fragility of the enemy and player alike interrupt the action by making the margin for error so slim that what should be exciting sequences end up coming across more like someone repeatedly sitting on a remote control’s pause button during an intense scene by mistake.<\/p>\n\n<p>Aside from the few levels that validate Modern Warfare II’s emphasis on variety, the traditionally designed firefights make the campaign exciting. One involves the player participating in raids on a series of rural homes, navigating the inky darkness of an overcast night through the queasy green of night-vision goggles. It even ends with you defending a crashed helicopter from inside its ruined interior while enemies advance to attack from across a smoking, firelit field. Even if the game featured a few more missions with staging this compelling, the plot would still color Modern Warfare II in offputting tones. Simply put: None of its cast seems to care about anything.<\/p>\n\n<p>During cutscene interludes breaking up the action, the characters find little time to discuss their mission beyond identifying the next part of the globe to fly off to or the next enemy who needs their brain pulped. They are all blandly gruff, almost seeming to compete in a gravel gargling contest as they discuss the grim necessities of extrajudicial murder or trade strained banter during tense moments. These are the kind of characters who, when handed a hunting knife with which to kill a cartel boss, grumble the single word “sweet” in response.<\/p>\n\n<p>No motivation is expressed by the characters beyond the most cynical realpolitik or greed. If any members of Task Force 141 have nuanced opinions about the countries whose militaries they’re fighting or the cartel forces abetting an international terror plot, they keep it to themselves. Even Zyani speaks of his hatred of America in only the most general terms. There is no greater political or religious mission for anyone, likely in fear of alienating any demographic that may play the game. There are only reactions to circumstances – a kind of kneejerk fantasy of global politics that sidesteps historical context in favor of painting an Iranian major as an uncomplicatedly evil villain.<\/p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\n\n  \n    \n\n  \n      \n            <img src=\"https:\/\/www.gameinformer.com\/sites\/default\/files\/styles\/body_default\/public\/2022\/06\/09\/f8b2189b\/cod2.jpg\" typeof=\"foaf:Image\" alt=\"\" class=\"image-style-body-default\" \/>\n\n\n      \n  \n\n\n\n\n\n\n\n\n\n\n<p>One exception to this nihilistic pattern is Colonel Vargas, who is forced to shoulder the massive weight of Modern Warfare II’s stunningly grim depiction of Mexico. As one of the few heroic viewpoint characters, Vargas is asked to embody the noble and incorruptible crime-fighter that, in Call of Duty’s viewpoint, is the only possible means of solving a nation’s complex internal and hegemonically enforced problems. Though Vargas is a welcome character in this sense – him narrowly avoiding death from the overeager trigger fingers of police and armed citizens of a Texan border town who can’t distinguish between him and cartel sicarios is striking – he’s also an overly simplistic one. Vargas, like the game’s depiction of Mexico as a whole, is drawn from a position of sanctimonious pity – one that sees the country populated not by criminals, as in the simple, racist viewpoint, but by perpetually doomed unfortunates whose misery can’t be understood beyond its inevitability.    <\/p>\n\n<p>Vargas, however, is just one character among many, and the question remains, as is the case with every Call of Duty entry, of what purpose the dead-end ugliness of the rest of the game serves. That Modern Warfare II’s characters exist is not an endorsement of their actions. That the story they star in exists to frame their attitudes toward the world, though, means all of the virtual shooting and death must mean something.<\/p>\n\n<p>Unfortunately, Modern Warfare II has no ready answers to these questions. The campaign’s story is agile in side-stepping concrete ideological positions, slippery in establishing any political footing beyond a basic recognition that attacking civilian populations is morally wrong. The game's writers seem to believe in very little beyond the current status quo of international politics, anxious to avoid much specificity and, by doing so, resigned to a stalemate existence of looming terror and secret wars fought by covert operatives forevermore. As an extension of this, Modern Warfare II asserts that our desire to play pretend in its fevered war dreams is testament to there being a magnetic thrill to witnessing the kind of combat in which regular military and special operatives engage around the world.<\/p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\n\n  \n    \n\n  \n      \n            <img src=\"https:\/\/www.gameinformer.com\/sites\/default\/files\/styles\/body_default\/public\/2022\/11\/01\/5872739b\/mw2-home-spec-ops.jpg\" typeof=\"foaf:Image\" alt=\"\" class=\"image-style-body-default\" \/>\n\n\n      \n  \n\n\n\n\n\n\n\n\n\n\n<p>The multiplayer, as always, functions as the best proof of this assertion. Compulsively thrilling in its best modes – Domination, Team Deathmatch, Hardpoint, and Kill Confirmed – Modern Warfare II’s gunplay finds better expression in the hamster wheel of endless online competition than it does in its single-player mode this time around. <\/p>\n\n<p>Few major changes have been introduced to multiplayer overall, but the tweaks that have been made to player movement, the speed at which competitors can kill (or be killed), and loadout customization options work to make Modern Warfare II's online some of the series' best in recent years. The result is less a drastic overhaul to the style of online shooting that Call of Duty's featured for years and more a welcome series of refinements that amplify what works and minimize what doesn't.     <\/p>\n\n<p>New modes, like Prisoner Rescue, playlists featuring a disorienting third-person camera, and a trio of co-op missions, are less exciting, but their inclusion doesn’t take away from the substantial volume of returning modes that take place in the new maps and provide a framework for exceptional shooting. Freed from the single-player’s trappings, appreciating the game’s feel is easier. The elastic response of pressing a controller trigger so an assault rifle’s sights spring up into view, the dull thud of rounds hitting home, and the spry weight of the player character: Modern Warfare II’s multiplayer is a tightly designed display of its makers’ talents.<\/p>\n\n                  <section class='type:slideshow'><figure><img src='https:\/\/www.gameinformer.com\/sites\/default\/files\/styles\/body_default\/public\/2022\/11\/01\/d5941685\/mw2-seasonal.jpg'><\/figure><figure><img src='https:\/\/www.gameinformer.com\/sites\/default\/files\/styles\/body_default\/public\/2022\/09\/15\/6751b69b\/mw1.jpg'><\/figure><figure><img src='https:\/\/www.gameinformer.com\/sites\/default\/files\/styles\/body_default\/public\/2022\/09\/15\/f1ba6fa3\/mw2.jpg'><\/figure><figure><img src='https:\/\/www.gameinformer.com\/sites\/default\/files\/styles\/body_default\/public\/2022\/09\/15\/4d8b6886\/mw3.jpg'><\/figure><figure><img src='https:\/\/www.gameinformer.com\/sites\/default\/files\/styles\/body_default\/public\/2022\/06\/09\/53b0efc3\/cod1.jpg'><\/figure><figure><img src='https:\/\/www.gameinformer.com\/sites\/default\/files\/styles\/body_default\/public\/2022\/06\/08\/ef799de4\/mw2map.jpg'><\/figure><\/section>\n           \n\n<p>But still, the game’s dismal narrative creeps in to curdle even its best features. Maps like a Mexico-U.S. border crossing traffic jam, bombed-out Ottoman forts in a fictitious Middle Eastern village, and a Mexican city turned battlefield are all excellent blueprints for online shoot-outs. But they also serve as a reminder that the multiplayer is a reflection of the campaign’s plot. Severed from its storyline, the disjointed visions of nations in flames and ruins, overrun by soldiers, are hardly less nasty than the rest of the narrative.  <\/p>\n\n<p>Severing these connections and focusing instead of the immediate pleasures of competition is tough but not impossible. With a few friends talking over the crack of gunfire and an eye trained on the burst of experience points that pop from a newly dead opponent, Modern Warfare II is perfectly enjoyable. But this kind of wilful blindness is hard to maintain, and the impression left is overwhelmed by the unpleasantness that defines so much of the game. Ignoring that for long makes it much harder to appreciate what Modern Warfare II does right than it should be.<\/p>\n\n<p>Whether any of this is enough to put off an audience inured to Call of Duty’s detached depiction of brutal warfare is anyone’s guess. Plenty of people can put up with a bit of ugliness if there’s still a pretty good time to be had overall. For Modern Warfare II, the good time offered by its multiplayer and in glimpses within its campaign may be enough.<\/p>\n  \n\n    <h2>Score:\n    6.5<\/h2>\n  <p>\n    <a href=\"https:\/\/www.gameinformer.com\/scoring\" target=\"_blank\">About Game Informer's review system<\/a>\n  <\/p>\n\n<a href=\"https:\/\/www.gamestop.com\/search\/?q=Call%20of%20Duty%3A%20Modern%20Warfare%20II\" target=\"_blank\" class=\"button\">Purchase<\/a>","author_name":"Reid McCarter","timestamp":1667328420,"updated":1667328420,"url":"https:\/\/www.gameinformer.com\/review\/call-of-duty-modern-warfare-ii\/wide-of-the-mark","guid":"119426","tags":[],"geolocations":null,"enclosures":null,"feed_title":"Game Informer Reviews","feed_description":"From the biggest triple-A releases to cult indie hits, Game Informer reviews identify which games are worth your time.","feed_url":"https:\/\/www.gameinformer.com\/","author_email":""}